#+TITLE: NEAD - New Environmental Archive Data


* Table of contents                               :toc_3:noexport:
- [[#citation][Citation]]
  - [[#file-format][File format]]
- [[#warning][WARNING]]
- [[#installation][Installation]]
- [[#usage][Usage]]

* Citation

Iosifescu Enescu, I., Bavay, M., Plattner, G.-K. (2020). Sharing and reusing meteorological data. WMO Data Conference 2020 - Earth System Data Exchange in the 21st Century (Virtual Conference).

** File format

The NEAD file format is described in [[https://en.wikipedia.org/wiki/Extended_Backus%E2%80%93Naur_form][EBNF]] syntax in [[./EBNF.org]] and graphically at https://raw.githubusercontent.com/GEUS-PROMICE/NEAD/main/NEAD.svg 
* WARNING

+ This is alpha level software under development.
+ Please contact Ken Mankoff <kdm@geus.dk> before using.

* Installation

#+BEGIN_SRC bash :results verbatim
pip install git+https://github.com/mankoff/NEAD.git
#+END_SRC

Can be run in new environment, for example:

Conda:

#+BEGIN_SRC bash :results verbatim
conda create -n NEAD python=3.8 pandas numpy # jupyter
conda activate NEAD
pip install --upgrade git+https://github.com/mankoff/NEAD.git
#+END_SRC

* Usage
:PROPERTIES:
:header-args:jupyter-python+: :kernel PROMICE_dev :session nead :exports both :results raw drawer :exports both
:END:

Read a NEAD file:

#+BEGIN_SRC jupyter-python 
import nead.nead_io as nead
import importlib
importlib.reload(nead)

df = nead.read_nead("sample_csv.dsv")
df.head()
#+END_SRC

#+RESULTS:
|   | timestamp           |     TA |   RH |  VW | ISWR |
|---+---------------------+--------+------+-----+------|
| 0 | 2010-06-22T12:00:00 | 275.15 | 0.52 | 1.2 |  320 |
| 1 | 2010-06-22T13:00:00 | 276.15 |  0.6 | 2.4 |  340 |
| 2 | 2010-06-22T14:00:00 | 275.95 | 0.56 |   2 |  330 |

Do not convert to MKS units and also pass arguments to the Pandas [[https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html][read_csv]] command:

#+BEGIN_SRC jupyter-python
import nead.nead_io as nead
df = nead.read_nead("sample_csv.dsv", index_col=0, parse_dates=True, MKS=False)
df.head()
#+END_SRC

#+RESULTS:
| timestamp           |  TA | RH |  VW | ISWR |
|---------------------+-----+----+-----+------|
| 2010-06-22 12:00:00 |   2 | 52 | 1.2 |  320 |
| 2010-06-22 13:00:00 |   3 | 60 | 2.4 |  340 |
| 2010-06-22 14:00:00 | 2.8 | 56 |   2 |  330 |

You can access the header properties in the =.attrs= dictionary.

#+BEGIN_SRC jupyter-python :exports both
import nead.nead_io as nead
df = nead.read_nead("sample_csv.dsv", index_col=0, parse_dates=True, MKS=False)

for k in df.attrs.keys():
  print(k, '=', df.attrs[k])
#+END_SRC

#+RESULTS:
#+begin_example
__format__ = NEAD 1.0 UTF-8
station_id = test_station
latitude = 46.5
longitude = 9.8
altitude = 1500
nodata = -999
tz = +01
column_delimiter = ,
fields = ['timestamp', 'TA', 'RH', 'VW', 'ISWR']
units_offset = [  0.   273.15   0.     0.     0.  ]
units_multiplier = [1.   1.   0.01 1.   1.  ]
#+end_example

